{
  "architectures": [
    "DebertaV2ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "a30_credit_card",
    "1": "a31_passport",
    "2": "a32_drivers_license",
    "3": "a33_student_id",
    "4": "a35_mail",
    "5": "a37_receipt",
    "6": "a38_ticket"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "a30_credit_card": 0,
    "a31_passport": 1,
    "a32_drivers_license": 2,
    "a33_student_id": 3,
    "a35_mail": 4,
    "a37_receipt": 5,
    "a38_ticket": 6
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
